## DataFrame Basics

In [1]:
%config Completer.use_jedi = False
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=["A", "B", "C"], index=["x", "y", "z"])

In [2]:
df.head() # Characters on the left are the indexes, and characters at the top are columns

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [8]:
df.tail(2)

   A  B  C
y  4  5  6
z  7  8  9

In [9]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [10]:
print(df.index)
print(df.index.tolist())

Index(['x', 'y', 'z'], dtype='object')
['x', 'y', 'z']

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

df.describe()

In [8]:
df.nunique()

A    3
B    3
C    3
dtype: int64

In [9]:
df['A'].nunique()

3

In [10]:
df.shape # (number of rows, number of columns)

(3, 3)

In [11]:
df.size

9

## Loading/Manipulating Dataframes

In [163]:
coffee = pd.read_csv('./complete-pandas-tutorial/warmup-data/coffee.csv')
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [16]:
results = pd.read_parquet('./complete-pandas-tutorial/data/results.parquet') # Will be using this dataset
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [11]:
olympics_data = pd.read_excel('./complete-pandas-tutorial/data/olympics-data.xlsx', sheet_name="results")
olympics_data.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [20]:
bios = pd.read_csv('./complete-pandas-tutorial/data/bios.csv') # Will also be using this dataset
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [28]:
coffee.sample(10, random_state=1) # Random set of data; setting random_state to 1 makes it deterministic and thus the same each time

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
7    Thursday       Latte          30
6    Thursday    Espresso          40
2     Tuesday    Espresso          30
10   Saturday    Espresso          45
4   Wednesday    Espresso          35
1      Monday       Latte          15
12     Sunday    Espresso          45
0      Monday    Espresso          25
13     Sunday       Latte          35

In [20]:
display(coffee) # display() looks nicer than print()

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

## Loc and iloc

In [44]:
# loc syntax: dataset.loc[rows, columns]
display(coffee.loc[0]) # Shows the first row
display(coffee.loc[[0, 1, 2]]) # Shows the first three rows
display(coffee.loc[5:12]) # Shows a set of rows from index 5 to 12 (loc includes the upper bound)

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

          Day Coffee Type  Units Sold
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45

In [46]:
coffee.loc[5:8, ["Day", "Units Sold"]] # Shows rows 5-8 and the info in columns "Day" and "Units Sold"

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45

In [49]:
# iloc only uses indexing and slicing
# Unlike loc, iloc EXCLUDES the upper bound
coffee.iloc[0:5, [0, 2]] # Shows rows 1-4, the info in the column with index 0, and the info in the column with index 2

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

In [62]:
# To get the index of a dataset:
coffee.index

Index(['Monday', 'Monday', 'Tuesday', 'Tuesday', 'Wednesday', 'Wednesday',
       'Thursday', 'Thursday', 'Friday', 'Friday', 'Saturday', 'Saturday',
       'Sunday', 'Sunday'],
      dtype='object', name='Day')

In [64]:
# You can also change the indexes, in this case by assigning the values in the "Day" column as the new indexes:
coffee.index = coffee.Day
coffee.index = coffee["Day"]
# (These lines do the same thing)

In [65]:
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [66]:
# Since the row indexes are now days, not numbers, using number indexes with loc or iloc won't work:
coffee.loc[0:4]

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [67]:
# But the benefit is that now you can filter through the data more easily; in this case, I can now filter only the rows that have Monday
display(coffee.loc["Monday"])
# Or I can find a subset of rows ranging from those with index "Monday" to those with index "Wednesday" 
coffee.loc["Monday":"Wednesday"]

           Day Coffee Type  Units Sold
Day
Monday  Monday    Espresso          25
Monday  Monday       Latte          15

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25

In [3]:
coffee = pd.read_csv('./complete-pandas-tutorial/warmup-data/coffee.csv') # Reloading the dataset so we get the numerical indexes again
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [4]:
# You can use loc and iloc to change specific values in the dataset.
# i.e. change the number of lattes sold on Monday from 15 to 10:
coffee.loc[1, "Units Sold"] = 10
coffee.loc[1]

Day            Monday
Coffee Type     Latte
Units Sold         10
Name: 1, dtype: object

In [5]:
# Set multiple values to 6:
coffee.loc[0:2, "Units Sold"] = 6
coffee.loc[0:2]
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso           6
1      Monday       Latte           6
2     Tuesday    Espresso           6
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [6]:
# at and iat get SINGULAR values (like loc and iloc, at uses row and column labels, while iat uses only integer values)
coffee.at[0, "Units Sold"]

np.int64(6)

In [7]:
coffee.iat[0, 0]

'Monday'

## Accessing Data | Grab Columns, Sort Values, Ascending/Descending

In [164]:
coffee = pd.read_csv('./complete-pandas-tutorial/warmup-data/coffee.csv') # Reloading the dataset so it's back to normal
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [9]:
coffee.sort_values("Units Sold") # Sorts the dataset by the values in "Units Sold" in ascending order by default

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          30
7    Thursday       Latte          30
4   Wednesday    Espresso          35
9      Friday       Latte          35
13     Sunday       Latte          35
11   Saturday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [10]:
coffee.sort_values("Units Sold", ascending=False) # To arrange in descending order

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [11]:
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[0, 1]) 
# This first sorts by "Units Sold" in descending order.
# Then, if there are any rows with the same "Units Sold" value, they will be sorted in ascending order.

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [12]:
# To see more, look at rows 2 and 7 above. Currently, 2 is before 7 because Espresso is before Latte alphabetically
# Now look below, where 7 is before 2 because the "Coffee Type" row was sorted in descending order instead:
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[0, 0])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
7    Thursday       Latte          30
2     Tuesday    Espresso          30
5   Wednesday       Latte          25
0      Monday    Espresso          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [13]:
# You can also iterate through the rows using a for loop with iterrows():
for index, row in coffee.iterrows():
    print(index)
    print(row)
    print("\n")

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object


1
Day            Monday
Coffee Type     Latte
Units Sold         15
Name: 1, dtype: object


2
Day             Tuesday
Coffee Type    Espresso
Units Sold           30
Name: 2, dtype: object


3
Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object


4
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object


5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object


6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object


7
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object


8
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object


9
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object


10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object


11
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object


12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object


13
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object

In [112]:
# This is also helpful to quickly get a specific column value in each row with the corresponding row index:

In [14]:
for index, row in coffee.iterrows():
    print(index)
    print(row["Units Sold"])
    print("\n")

0
25


1
15


2
30


3
20


4
35


5
25


6
40


7
30


8
45


9
35


10
45


11
35


12
45


13
35

In [15]:
# This is usually faster though
coffee["Units Sold"]

0     25
1     15
2     30
3     20
4     35
5     25
6     40
7     30
8     45
9     35
10    45
11    35
12    45
13    35
Name: Units Sold, dtype: int64

## Filtering Data - Using Olympic Data

In [21]:
# Let's filter the olympic bios dataset by height and weight.
bios.head()
# Do .info() to see what data types the height and weight columns hold
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [22]:
# Filter to get all athletes taller than 215 cm
bios.loc[bios['height_cm'] > 215, ['name', 'height_cm']] # Specifed which columns to show so the output is simpler

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [23]:
# A simpler way to filter this is just:
bios[bios['height_cm'] > 215][['name', 'height_cm']] # This is typical Pandas syntax: df[row/condition that selects various rows][selected column(s) from the row(s)]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [24]:
# You can also add additional conditions to filter even more:
bios[(bios['height_cm'] > 215) & (bios['born_country'] == 'USA')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

In [25]:
bios[bios['name'].str.contains('Keith')] 
# This shows all the rows with the substring 'Keith' in the 'name' column
# Use case=false as a second argument within contains() to make it case-insensitive

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [26]:
bios[bios['name'].str.contains('keith|patrick', case=False)] # This uses regular expressions to show all rows whose 'name' has Keith OR Patrick in it

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN
119,120,Patrick Wheatley,1899-01-20,Vryheid,KwaZulu-Natal,RSA,Great Britain,NaN,NaN,1967-11-05
319,320,Patrick De Koning,1961-04-23,Dendermonde,Oost-Vlaanderen,BEL,Belgium,178.0,92.0,NaN
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
2115,2125,Patrick Jopp,1962-01-08,NaN,NaN,NaN,Switzerland,176.0,67.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143975,147633,Patrick Chinyemba,2001-01-03,NaN,NaN,NaN,Zambia,NaN,NaN,NaN
144172,147850,Patrick Jakob,1996-10-17,Sankt Johann in Tirol,Tirol,AUT,Austria,NaN,NaN,NaN
144547,148239,Patrick Galbraith,1986-03-11,Haderslev,Syddanmark,DEN,Denmark,NaN,NaN,NaN
144565,148257,Patrick Russell,1993-01-04,Gentofte,Hovedstaden,DEN,Denmark,186.0,93.0,NaN
145435,149158,Patrick Gasienica,1998-11-28,McHenry,Illinois,USA,United States,NaN,NaN,2023-06-12

In [27]:
bios[bios['born_country'].isin(['USA', 'FRA', 'GBR'])]
# .isin(['x', 'y', 'z']) checks if any of the values in the specified column (the values in 'born_country' in this case) 
# are in -- or are equal to any of the values in -- the list within the .isin() parentheses

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN
145467,149194,Elisa Nakab,1998-05-08,Briançon,Hautes-Alpes,FRA,Italy,NaN,NaN,NaN
145468,149195,Justin Abdelkader,1987-02-25,Muskegon,Michigan,USA,United States,187.0,97.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18

In [28]:
bios[bios['born_country'].isin(['USA', 'FRA', 'GBR']) & bios['name'].str.startswith('Keith')] # str.startswith() is good here to filter out any Keiths as last names

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
14577,14674,Keith Harrison,1933-03-28,Birmingham,England,GBR,Great Britain,NaN,NaN,NaN
16166,16281,Keith Reynolds,1963-12-25,Solihull,England,GBR,Great Britain,173.0,68.0,NaN
18734,18862,Keith Sinclair,1945-06-26,Sunderland,England,GBR,Great Britain,190.0,79.0,NaN
29897,30123,Keith Langley,1961-06-03,Aldershot,England,GBR,Great Britain,173.0,70.0,NaN
34011,34275,Keith Remfry,1947-11-17,Ealing,England,GBR,Great Britain,193.0,114.0,2015-09-16
46885,47234,Keith Collin,1937-01-18,Marylebone,England,GBR,Great Britain,168.0,63.0,1991-03-06
50929,51288,Keith Carter,1924-08-30,Akron,Ohio,USA,United States,NaN,NaN,2013-05-03
51185,51544,Keith Russell,1948-01-15,Mesa,Arizona,USA,United States,188.0,73.0,NaN
52913,53288,Keith Erickson,1944-04-19,San Francisco,California,USA,United States,196.0,86.0,NaN
55317,55712,Keith Boxell,1958-05-06,Clapham,England,GBR,Great Britain,170.0,87.0,NaN
57818,58226,Keith Peache,1947-08-10,Lewisham,England,GBR,Great Britain,180.0,98.0,NaN
61748,62202,Keith Grogono,1912-11-04,Stratford,England,GBR,Great Britain,NaN,NaN,1999-03-22
62620,63086,Keith Musto,1936-01-12,Rochford,England,GBR,Great Britain,174.0,72.0,NaN
62678,63144,Keith Notary,1960-01-22,Merritt Island,Florida,USA,United States,170.0,66.0,NaN
68324,68841,Keith Angus,1943-04-05,Sheffield,England,GBR,Great Britain,170.0,59.0,NaN
68472,68989,Keith Cullen,1972-06-13,Ilford,England,GBR,Great Britain,177.0,61.0,NaN
68997,69514,Keith Stock,1957-03-18,Woolwich,England,GBR,Great Britain,176.0,73.0,NaN
77550,78141,Keith Brantly,1962-05-23,Scott Air Force Base,Illinois,USA,United States,180.0,64.0,NaN
84097,84766,Keith Christiansen,1944-07-14,International Falls,Minnesota,USA,United States,165.0,69.0,2018-11-05
94646,95413,Keith Meyer,1938-06-20,Geneva,Illinois,USA,United States,NaN,NaN,2010-07-25
95267,96037,Keith Oliver,1947-10-27,Liverpool,England,GBR,Great Britain,172.0,68.0,NaN
96452,97229,Keith Schellenberg,1929-03-13,Middlesbrough,England,GBR,Great Britain,NaN,NaN,2019-10-28
97499,98286,Keith Tkachuk,1972-03-28,Melrose,Massachusetts,USA,United States,188.0,102.0,NaN
98068,98860,Keith Wegeman,1929-08-28,Denver,Colorado,USA,United States,NaN,NaN,1974-08-22
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN

In [29]:
# .query() is another, somewhat faster way to filter 
bios.query('born_country == "USA" and born_city == "Madison"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
16384,16500,Robert Schneider,1944-01-17,Madison,Wisconsin,USA,United States,183.0,77.0,NaN
40154,40462,Carie Graves,1953-06-27,Madison,Wisconsin,USA,United States,186.0,77.0,2021-12-19
40216,40525,Jackie Zoch,1949-06-08,Madison,Wisconsin,USA,United States,180.0,76.0,NaN
40547,40856,Chris Sahs,1970-07-09,Madison,Wisconsin,USA,United States,195.0,93.0,NaN
46652,47001,Annabelle Cripps,1968-02-16,Madison,Wisconsin,USA,Great Britain,180.0,66.0,NaN
50746,51105,Helene Madison,1913-06-19,Madison,Wisconsin,USA,United States,NaN,NaN,1970-11-25
50989,51348,Steve Furniss,1952-12-21,Madison,Wisconsin,USA,United States,193.0,80.0,NaN
51061,51420,Patrick Jeffrey,1965-06-24,Madison,New Jersey,USA,United States,168.0,68.0,NaN
51135,51494,Jim Montgomery,1955-01-24,Madison,Wisconsin,USA,United States,191.0,88.0,NaN
51260,51619,Paul Wolf,1915-10-05,Madison,Indiana,USA,United States,NaN,NaN,1972-10-14
52932,53307,Jeff Nygaard,1972-08-03,Madison,Wisconsin,USA,United States,195.0,90.0,NaN
54555,54948,Harold McCallister,1903-10-14,Madison,South Dakota,USA,United States,NaN,NaN,1997-10-22
60223,60655,Russ Hellickson,1948-05-29,Madison,Wisconsin,USA,United States,180.0,95.0,NaN
60808,61247,Peter Barrett,1935-02-20,Madison,Wisconsin,USA,United States,184.0,88.0,2000-12-17
77365,77956,Michelle Rohl,1965-11-12,Madison,Wisconsin,USA,United States,150.0,41.0,NaN
77570,78161,Hal Brown,1898-03-30,Madison,New Jersey,USA,United States,172.0,66.0,1983-12-25
78002,78593,Clare Jacobs,1886-02-18,Madison,South Dakota,USA,United States,178.0,64.0,1971-02-21
78564,79155,Gene Vidal,1895-04-13,Madison,South Dakota,USA,United States,178.0,82.0,1969-02-20
80143,80794,Connie Carpenter-Phinney,1957-02-26,Madison,Wisconsin,USA,United States,178.0,59.0,NaN
80289,80940,Dorcas DenHartog-Wonsavage,1965-02-03,Madison,Wisconsin,USA,United States,162.0,54.0,NaN
80305,80956,Mary Docter,1961-02-11,Madison,Wisconsin,USA,United States,167.0,63.0,NaN
80306,80957,Sarah Docter,1964-05-10,Madison,Wisconsin,USA,United States,167.0,57.0,NaN
80623,81274,Beth Heiden,1959-09-27,Madison,Wisconsin,USA,United States,157.0,48.0,NaN
81065,81717,Kay Lunda,1957-04-28,Madison,Wisconsin,USA,United States,167.0,58.0,NaN
81212,81864,Lori Monk,1956-03-20,Madison,Wisconsin,USA,United States,175.0,66.0,NaN
83306,83965,Marc Behrend,1961-01-11,Madison,Wisconsin,USA,United States,185.0,84.0,NaN
83429,84090,Dave Besteman,1963-02-02,Madison,Wisconsin,USA,United States,173.0,70.0,NaN
84272,84943,David Currier,1952-04-20,Madison,New Hampshire,USA,United States,178.0,69.0,NaN
85869,86551,Eric Heiden,1958-06-14,Madison,Wisconsin,USA,United States,185.0,84.0,NaN
86645,87337,Dan Immerfall,1955-12-14,Madison,Wisconsin,USA,United States,175.0,73.0,NaN
94856,95623,Peter Mueller,1954-07-27,Madison,Wisconsin,USA,United States,180.0,77.0,NaN
95111,95880,Jeremy Nobis,1970-08-31,Madison,Wisconsin,USA,United States,178.0,79.0,2023-04-19
96062,96837,Barry Richter,1970-09-11,Madison,Wisconsin,USA,United States,188.0,93.0,NaN
97022,97802,Kurt Stein,1970-06-30,Madison,Wisconsin,USA,United States,178.0,64.0,NaN
97198,97983,Rob Suter,1957-05-16,Madison,Wisconsin,USA,United States,175.0,81.0,2014-09-09
98548,99344,Casey FitzRandolph,1975-01-21,Madison,Wisconsin,USA,United States,180.0,79.0,NaN
99508,100307,Erika Brown,1973-01-25,Madison,Wisconsin,USA,United States,170.0,64.0,NaN
99915,100716,Gary Suter,1964-06-24,Madison,Wisconsin,USA,United States,183.0,93.0,NaN
101720,102649,Lindsay Tarpley,1983-09-22,Madison,Wisconsin,USA,United States,165.0,58.0,NaN
117711,119236,Jessie Vetter,1985-12-19,Madison,Wisconsin,USA,United States,173.0,70.0,NaN
117811,119347,Phil Kessel,1987-10-02,Madison,Wisconsin,USA,United States,183.0,92.0,NaN
117826,119366,Ryan Suter,1985-01-21,Madison,Wisconsin,USA,United States,185.0,91.0,NaN
126343,128694,Craig Brown,1975-08-18,Madison,Wisconsin,USA,United States,170.0,70.0,NaN
126381,128733,Amanda Kessel,1991-08-28,Madison,Wisconsin,USA,United States,165.0,64.0,NaN
129416,132032,Heather Miller-Koch,1987-03-30,Madison,Wisconsin,USA,United States,175.0,64.0,NaN
135117,138257,Joanne Reid,1992-06-28,Madison,Wisconsin,USA,United States,165.0,52.0,NaN
135136,138279,Becca Hamilton,1990-07-12,Madison,Wisconsin,USA,United States,165.0,76.0,NaN
135138,138281,Nina Roth,1988-07-21,Madison,Wisconsin,USA,United States,165.0,65.0,NaN
135140,138283,Matt Hamilton,1989-02-19,Madison,Wisconsin,USA,United States,188.0,98.0,NaN
143569,147222,Jessica Thoennes,1995-09-20,Madison,Wisconsin,USA,United States,188.0,NaN,NaN
145364,149087,Gus Schumacher,2000-07-25,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN

## Adding/Removing Columns

In [184]:
# Returning to the coffee dataframe briefly, here's how you can add a new column:
coffee = pd.read_csv('./complete-pandas-tutorial/warmup-data/coffee.csv')
coffee['Price'] = 4.99
coffee.head()

         Day Coffee Type  Units Sold  Price
0     Monday    Espresso          25   4.99
1     Monday       Latte          15   4.99
2    Tuesday    Espresso          30   4.99
3    Tuesday       Latte          20   4.99
4  Wednesday    Espresso          35   4.99

In [185]:
import numpy as np

coffee['New Price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99) 
# np.where() takes a condition for each value of a specified column ('Coffee Type' in this case), a value that will be assigned to the corresponding row in the new 'New Price' column if
# the condition is true (3.99), and a value to be assigned if the condition is false (5.99).
coffee.head()

         Day Coffee Type  Units Sold  Price  New Price
0     Monday    Espresso          25   4.99       3.99
1     Monday       Latte          15   4.99       5.99
2    Tuesday    Espresso          30   4.99       3.99
3    Tuesday       Latte          20   4.99       5.99
4  Wednesday    Espresso          35   4.99       3.99

In [186]:
coffee.drop(columns=['Price'], inplace=True)
# .drop() can remove columns by putting the argument columns=['col1', 'col2' etc.] and you can apply this change by doing inplace=True 
# coffee = coffee.drop(columns=['Price']) also does the same thing

In [187]:
coffee.head()

         Day Coffee Type  Units Sold  New Price
0     Monday    Espresso          25       3.99
1     Monday       Latte          15       5.99
2    Tuesday    Espresso          30       3.99
3    Tuesday       Latte          20       5.99
4  Wednesday    Espresso          35       3.99

In [188]:
coffee_new = coffee.copy() # Do this every time you want to create a new version of a dataframe
coffee_new['Price'] = 4.99
coffee.head() # In doing so, you maintain the current state of the coffee dataframe (it's not mixed up with the state of coffee_new)

         Day Coffee Type  Units Sold  New Price
0     Monday    Espresso          25       3.99
1     Monday       Latte          15       5.99
2    Tuesday    Espresso          30       3.99
3    Tuesday       Latte          20       5.99
4  Wednesday    Espresso          35       3.99

In [189]:
coffee = coffee[['Day', 'Coffee Type', 'Units Sold', 'New Price']] # This is another, slightly more tedious way of selecting certain columns
coffee.head()

         Day Coffee Type  Units Sold  New Price
0     Monday    Espresso          25       3.99
1     Monday       Latte          15       5.99
2    Tuesday    Espresso          30       3.99
3    Tuesday       Latte          20       5.99
4  Wednesday    Espresso          35       3.99

In [190]:
# Practical application: Adding a revenue column
coffee['Revenue'] = coffee['Units Sold'] * coffee['New Price']
coffee.head()

         Day Coffee Type  Units Sold  New Price  Revenue
0     Monday    Espresso          25       3.99    99.75
1     Monday       Latte          15       5.99    89.85
2    Tuesday    Espresso          30       3.99   119.70
3    Tuesday       Latte          20       5.99   119.80
4  Wednesday    Espresso          35       3.99   139.65

In [191]:
coffee.rename(columns={'New Price': 'Price'}, inplace=True) # Renaming a column: columns argument takes a dictionary: {'current name of column': 'new name'}
coffee.head()

         Day Coffee Type  Units Sold  Price  Revenue
0     Monday    Espresso          25   3.99    99.75
1     Monday       Latte          15   5.99    89.85
2    Tuesday    Espresso          30   3.99   119.70
3    Tuesday       Latte          20   5.99   119.80
4  Wednesday    Espresso          35   3.99   139.65

In [192]:
# Moving back to bios data. Making a new bios dataframe to add a column with only first names
bios_new = bios.copy()
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0] # This takes all the names as strings, splits them into two chunks by the space between them, and selecting the first chunk
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert
...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill

In [50]:
bios_new.query('first_name == "Keith"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Keith
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Keith
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Keith
...,...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN,Keith
102227,103168,Keith Beavers,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN,Keith
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15,Keith
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN,Keith
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN,Keith

In [51]:
bios_new.info()
# Note that born_date is an object data type.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 12.2+ MB

In [67]:
# Use the Pandas .to_datetime() method to change the dates to datetime data types, as these are easier to work with.
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date']) # df['new_column (that will store dates as datetime Dtypes)'] = pd.to_datetime(df['original_column_with_dates'])
display(bios_new)
bios_new.info() # Now you can see the Dtype is datetime64

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,born_year
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André,1899-05-19,1899.0
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 13 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  born_datetime  143693 non-null  datetime64[ns]
 12  born_year      143693 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(8)
memory usage: 14.4+ MB

In [68]:
# Since the 'born_datetime' column holds datetime (or dt) Dtypes, there are a bunch of properties you can choose from -- just write df['column_with_dt_Dtypes'].dt. and press tab 
bios_new['born_year'] = bios_new['born_datetime'].dt.year
bios_new[['name', 'born_year']]

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

In [72]:
bios_new.to_csv('./complete-pandas-tutorial/data/bios_new.csv', index=False) # to_csv() saves this new dataframe in the data folder as a csv file
# Do index=False to get rid of the unnecessary index column that Pandas automatically adds

In [76]:
# You can use the apply() method to apply a lambda function that categorizes the data quickly
bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall

In [81]:
def categorize_athlete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] < 185 or row['weight_kg'] <= 80:
        return 'Middleweight'
    else:
        return 'Heavyweight'

bios['category'] = bios.apply(categorize_athlete, axis=1) 
# apply() just applies a certain function to every row or column in a dataframe
# When axis=0, the function is applied to every column
# When axis=1, the function is applied to every row
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight

In [88]:
categorize_athlete(bios.loc[1])

'Middleweight'

## Merging and Concatenating Data
## !! Add notes on how pd.merge() works

In [92]:
# Resetting bios dataframe
bios = pd.read_csv('./complete-pandas-tutorial/data/bios.csv')
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [93]:
nocs = pd.read_csv('./complete-pandas-tutorial/data/noc_regions.csv')
nocs.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [95]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')

In [100]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,born_country_full,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN

In [98]:
bios_new.rename(columns={'region': 'born_country_full'}, inplace=True)

In [99]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,born_country_full,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN

In [102]:
bios_new[bios_new['NOC_x'] != bios_new['born_country_full']][['name', 'NOC_x', 'born_country_full']]

                       name    NOC_x born_country_full
4              Albert Canet   France                UK
12                J. Defert   France               NaN
13           Étienne Durand   France               NaN
16               Guy Forget   France           Morocco
27       Guy, Baron Lejeune   France               NaN
...                     ...      ...               ...
145491        Matthew Wepke  Jamaica               NaN
145493   Landysh Falyakhova      ROC            Russia
145495    Polina Luchnikova      ROC            Russia
145496  Valeriya Merkusheva      ROC            Russia
145497      Yuliya Smirnova      ROC            Russia

[73210 rows x 3 columns]

In [108]:
# Let's make two dataframes with just people born in the US and the UK
usa = bios[bios['born_country'] == 'USA'].copy()
gbr = bios[bios['born_country'] == 'GBR'].copy()
display(usa.head(3))
display(gbr.head(3))

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
37,38,Helen Aitchison,1881-12-06,Sunderland,England,GBR,Great Britain,NaN,NaN,1947-05-26
38,39,Geraldine Beamish,1883-06-23,Forest Gate,England,GBR,Great Britain,NaN,NaN,1972-05-10

In [110]:
# Now let's add one on top of the other by concatenating them with pd.concat([df1, df2])
new_df = pd.concat([usa, gbr])
new_df

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN
...,...,...,...,...,...,...,...,...,...,...
144811,148512,Benjamin Alexander,1983-05-08,London,England,GBR,Jamaica,NaN,NaN,NaN
144815,148517,Ashley Watson,1993-10-28,Peterborough,England,GBR,Jamaica,NaN,NaN,NaN
145005,148716,Peder Kongshaug,2001-08-13,Wimbledon,England,GBR,Norway,184.0,86.0,NaN
145319,149041,Axel Brown,1992-04-02,Harrogate,England,GBR,Trinidad and Tobago,NaN,NaN,NaN
145388,149111,Jean-Luc Baker,1993-10-07,Burnley,England,GBR,United States,NaN,NaN,NaN

In [123]:
# Moving to results df
results = pd.read_csv('./complete-pandas-tutorial/data/results.csv')

In [129]:
results.tail()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
308403,2022.0,Winter,Luge,"Singles, Men (Olympic)",Marián Skupek,148983,SVK,NaN,26.0,False,NaN
308404,2022.0,Winter,Alpine Skiing (Skiing),"Slalom, Women (Olympic)",Elsa Fermbäck,148984,SWE,NaN,28.0,False,NaN
308405,2022.0,Winter,Alpine Skiing (Skiing),"Team, Mixed (Olympic)",Hilma Lövblom,148985,SWE,Sweden,13.0,False,NaN
308406,2022.0,Winter,Alpine Skiing (Skiing),"Giant Slalom, Women (Olympic)",Hilma Lövblom,148985,SWE,NaN,NaN,False,NaN
308407,2022.0,Winter,NaN,"Slalom, Women (Olympic)",Charlotta Säfvenberg,148986,NaN,NaN,24.0,False,NaN

In [128]:
combined_df = pd.merge(results, bios, on='athlete_id', how='left')
combined_df.tail()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
308403,2022.0,Winter,Luge,"Singles, Men (Olympic)",Marián Skupek,148983,SVK,NaN,26.0,False,NaN,Marián Skupek,2001-07-12,Gelnica,Košice,SVK,Slovakia,196.0,108.0,NaN
308404,2022.0,Winter,Alpine Skiing (Skiing),"Slalom, Women (Olympic)",Elsa Fermbäck,148984,SWE,NaN,28.0,False,NaN,Elsa Fermbäck,1998-03-28,Vemdalen,Jämtland,SWE,Sweden,NaN,NaN,NaN
308405,2022.0,Winter,Alpine Skiing (Skiing),"Team, Mixed (Olympic)",Hilma Lövblom,148985,SWE,Sweden,13.0,False,NaN,Hilma Lövblom,2000-08-16,Täby,Stockholm,SWE,Sweden,NaN,NaN,NaN
308406,2022.0,Winter,Alpine Skiing (Skiing),"Giant Slalom, Women (Olympic)",Hilma Lövblom,148985,SWE,NaN,NaN,False,NaN,Hilma Lövblom,2000-08-16,Täby,Stockholm,SWE,Sweden,NaN,NaN,NaN
308407,2022.0,Winter,NaN,"Slalom, Women (Olympic)",Charlotta Säfvenberg,148986,NaN,NaN,24.0,False,NaN,Charlotta Säfvenberg,1994-10-07,Kungsbacka,Halland,SWE,Sweden,NaN,NaN,NaN

## Handling Null Values

In [197]:
# Let's set two of the numbers in the 'Units Sold' column to null values by obtaining them via .loc, and setting them to np.nan
coffee.loc[[2, 3], 'Units Sold'] = np.nan
coffee

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0   3.99    99.75
1      Monday       Latte        15.0   5.99    89.85
2     Tuesday    Espresso         NaN   3.99   119.70
3     Tuesday       Latte         NaN   5.99   119.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   5.99   149.75
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   5.99   179.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   5.99   209.65
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   5.99   209.65
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   5.99   209.65

In [198]:
# Do this to see how many null values are in each column
coffee.isna().sum() # .isna() turns non-null values into False, and null values into True. .sum adds these up for each row

Day            0
Coffee Type    0
Units Sold     2
Price          0
Revenue        0
dtype: int64

In [199]:
# To handle null values, you can use .fillna() to replace them with something calculated from the existing data (or any value of your choice, but it's best to do the former)
coffee = coffee.fillna(coffee['Units Sold'].mean()) # In this case, each null value is replaced with the mean of the values in 'Units Sold'
coffee

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso   25.000000   3.99    99.75
1      Monday       Latte   15.000000   5.99    89.85
2     Tuesday    Espresso   34.166667   3.99   119.70
3     Tuesday       Latte   34.166667   5.99   119.80
4   Wednesday    Espresso   35.000000   3.99   139.65
5   Wednesday       Latte   25.000000   5.99   149.75
6    Thursday    Espresso   40.000000   3.99   159.60
7    Thursday       Latte   30.000000   5.99   179.70
8      Friday    Espresso   45.000000   3.99   179.55
9      Friday       Latte   35.000000   5.99   209.65
10   Saturday    Espresso   45.000000   3.99   179.55
11   Saturday       Latte   35.000000   5.99   209.65
12     Sunday    Espresso   45.000000   3.99   179.55
13     Sunday       Latte   35.000000   5.99   209.65

In [203]:
# .interpolate() is sometimes even better; it replaces nulls with values that continue the general trend of the rest of the values in the column
coffee.loc[[2, 3], 'Units Sold'] = np.nan # Putting in the null values again
coffee['Units Sold'] = coffee['Units Sold'].interpolate()
coffee

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso   25.000000   3.99    99.75
1      Monday       Latte   15.000000   5.99    89.85
2     Tuesday    Espresso   21.666667   3.99   119.70
3     Tuesday       Latte   28.333333   5.99   119.80
4   Wednesday    Espresso   35.000000   3.99   139.65
5   Wednesday       Latte   25.000000   5.99   149.75
6    Thursday    Espresso   40.000000   3.99   159.60
7    Thursday       Latte   30.000000   5.99   179.70
8      Friday    Espresso   45.000000   3.99   179.55
9      Friday       Latte   35.000000   5.99   209.65
10   Saturday    Espresso   45.000000   3.99   179.55
11   Saturday       Latte   35.000000   5.99   209.65
12     Sunday    Espresso   45.000000   3.99   179.55
13     Sunday       Latte   35.000000   5.99   209.65

In [205]:
# You can also use .dropna(), but that will drop any column that has null values entirely, so be careful with it
# i.e. coffee.dropna(inplace=True)
# i.e. coffee.dropna(subset=['Units Sold'], inplace=True) --> This only drops the 'Units Sold' column if it has null values

In [210]:
coffee.loc[[2, 3], 'Units Sold'] = np.nan # Putting in the null values again
display(coffee[coffee['Units Sold'].isna()]) # This returns all rows that have null values in the 'Units Sold' column
display(coffee[coffee['Units Sold'].notna()]) # This returns all rows that don't have null values in the 'Units Sold' column

       Day Coffee Type  Units Sold  Price  Revenue
2  Tuesday    Espresso         NaN   3.99    119.7
3  Tuesday       Latte         NaN   5.99    119.8

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0   3.99    99.75
1      Monday       Latte        15.0   5.99    89.85
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   5.99   149.75
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   5.99   179.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   5.99   209.65
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   5.99   209.65
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   5.99   209.65

## Aggregating Data

In [214]:
display(bios.head())
bios['born_city'].value_counts() # .value_counts() adds up all the same values in a given column (in this case, the names of cities in the 'born_city' column)
# We can see from the data that Budapest produces the most Olympic athletes

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Kirovgrad             1
Pereiaslav            1
Podgornyy             1
Kudepsta              1
Furmanov              1
Name: count, Length: 22368, dtype: int64

In [217]:
bios[bios['born_country'] == 'USA']['born_region'].value_counts() 
# This takes all the rows where the value in the 'born_country' column is 'USA', takes the values in the 'born_region' column of those rows, and adds values that are the same up

born_region
California              1634
New York                 990
Illinois                 585
Massachusetts            530
Pennsylvania             530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Kentucky                  62
Tennessee                 62
Nebraska                  60
Rhode Island              56
Montana                   55
Maine                     50
South Carolina            50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64

In [225]:
# Moving back to coffee data:
coffee.loc[[2, 3], ['Units Sold']] = [30, 20] # Getting rid of the nulls
coffee.head()

         Day Coffee Type  Units Sold  Price  Revenue
0     Monday    Espresso        25.0   3.99    99.75
1     Monday       Latte        15.0   5.99    89.85
2    Tuesday    Espresso        30.0   3.99   119.70
3    Tuesday       Latte        20.0   5.99   119.80
4  Wednesday    Espresso        35.0   3.99   139.65

In [232]:
# .groupby(['column whose values will serve as categories])['column whose values will be assigned to those categories based on which category they align with in the dataframe'].sum()
# i.e. in row 0 above, 25 espressos were sold. Since espressos are now grouped as a category, the corresponding value of 25 in the 'Units Sold' column is assigned to this group
# .sum() adds up all of these 'Units Sold' values assigned to each group/category
coffee.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    265.0
Latte       195.0
Name: Units Sold, dtype: float64

In [237]:
# You can do other things like take the mean of these grouped 'Units Sold' values as well (average number of espressos and lattes sold each day):
coffee.groupby(['Coffee Type'])['Units Sold'].mean()

Coffee Type
Espresso    37.857143
Latte       27.857143
Name: Units Sold, dtype: float64

In [236]:
# Using .agg({dict}) allows you to perform various operations on different columns, all of whose values are grouped by the values in the 'Coffee Type' column
coffee.groupby(['Coffee Type']).agg({'Units Sold': 'sum', 'Price': 'mean'})

             Units Sold  Price
Coffee Type
Espresso          265.0   3.99
Latte             195.0   5.99

In [239]:
coffee.groupby(['Coffee Type']).agg({'Units Sold': 'sum', 'Price': 'mean'})

             Units Sold  Price
Coffee Type
Espresso          265.0   3.99
Latte             195.0   5.99

In [246]:
# .pivot(columns=[], index='', values='') is a great way to basically create a new dataframe from your original one
# Here, we make the values in the 'Coffee Type' column into columns themselves, make the values be the corresponding values in the 'Revenue' column, and make the index the corresponding days
pivot = coffee.pivot(columns='Coffee Type', index='Day', values='Revenue')
pivot

Coffee Type  Espresso   Latte
Day
Friday         179.55  209.65
Monday          99.75   89.85
Saturday       179.55  209.65
Sunday         179.55  209.65
Thursday       159.60  179.70
Tuesday        119.70  119.80
Wednesday      139.65  149.75

In [248]:
# Now you can more easily access important data; for example, how much revenue you made from lattes on Monday:
pivot.loc['Monday', 'Latte']

np.float64(89.85000000000001)

In [250]:
# Total revenue from espressos and lattes
pivot.sum()

Coffee Type
Espresso    1057.35
Latte       1168.05
dtype: float64

In [252]:
# Total revenue per day
pivot.sum(axis=1)

Day
Friday       389.2
Monday       189.6
Saturday     389.2
Sunday       389.2
Thursday     339.3
Tuesday      239.5
Wednesday    289.4
dtype: float64

In [269]:
# Moving to bios dataframe:
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios.groupby(bios['born_date'].dt.year)['name'].count().reset_index().sort_values('name', ascending=False)
# This groups by the year one was born, counts up the number of people (# of names) born in each year group, establishes a new index for each row, and sorts the counts from highest to lowest

     born_date  name
139     1972.0  2231
152     1985.0  2227
140     1973.0  2216
138     1971.0  2205
137     1970.0  2174
..         ...   ...
4       1837.0     1
2       1833.0     1
6       1839.0     1
12      1845.0     1
176     2009.0     1

[177 rows x 2 columns]

In [276]:
# You could even group by year first, and then divide those groups up into smaller groups by month:
bios['month_born'] = bios['born_date'].dt.month
bios['year_born'] = bios['born_date'].dt.year
bios.groupby([bios['year_born'], bios['month_born']])['name'].count().reset_index().sort_values('name', ascending=False)
# We now know that the most olympic athletes born was in January of 1970, for example:

      year_born  month_born  name
1437     1970.0         1.0   239
1461     1972.0         1.0   229
1497     1975.0         1.0   227
1629     1986.0         1.0   227
1617     1985.0         1.0   225
...         ...         ...   ...
1877     2006.0        12.0     1
1871     2006.0         3.0     1
20       1846.0         7.0     1
21       1846.0         8.0     1
22       1846.0         9.0     1

[1885 rows x 3 columns]

## Advanced Functionality

In [281]:
# Moving to coffee data:
# You can use .shift(number of times you shift down in rows) to do stuff like...
# Creating a new column that shows the revenue made from a certain type of coffee yesterday (this could be useful since you can easily compare how much you made from today vs yesterday)
coffee['Yesterday Revenue'] = coffee['Revenue'].shift(2) # Values are shifted down two rows since two rows represent one day in this dataframe 
coffee

          Day Coffee Type  Units Sold  Price  Revenue  Yesterday Revenue
0      Monday    Espresso        25.0   3.99    99.75                NaN
1      Monday       Latte        15.0   5.99    89.85                NaN
2     Tuesday    Espresso        30.0   3.99   119.70              99.75
3     Tuesday       Latte        20.0   5.99   119.80              89.85
4   Wednesday    Espresso        35.0   3.99   139.65             119.70
5   Wednesday       Latte        25.0   5.99   149.75             119.80
6    Thursday    Espresso        40.0   3.99   159.60             139.65
7    Thursday       Latte        30.0   5.99   179.70             149.75
8      Friday    Espresso        45.0   3.99   179.55             159.60
9      Friday       Latte        35.0   5.99   209.65             179.70
10   Saturday    Espresso        45.0   3.99   179.55             179.55
11   Saturday       Latte        35.0   5.99   209.65             209.65
12     Sunday    Espresso        45.0   3.99   179.55             179.55
13     Sunday       Latte        35.0   5.99   209.65             209.65

In [286]:
coffee['Percent Change'] = coffee['Revenue'] / coffee['Yesterday Revenue'] * 100 - 100
coffee

,Day,Coffee Type,Units Sold,Price,Revenue,Yesterday Revenue,Percent Change
0,Monday,Espresso,25.0,3.99,99.75,NaN,NaN
1,Monday,Latte,15.0,5.99,89.85,NaN,NaN
2,Tuesday,Espresso,30.0,3.99,119.70,99.75,20.000000
3,Tuesday,Latte,20.0,5.99,119.80,89.85,33.333333
4,Wednesday,Espresso,35.0,3.99,139.65,119.70,16.666667
5,Wednesday,Latte,25.0,5.99,149.75,119.80,25.000000
6,Thursday,Espresso,40.0,3.99,159.60,139.65,14.285714
7,Thursday,Latte,30.0,5.99,179.70,149.75,20.000000
8,Friday,Espresso,45.0,3.99,179.55,159.60,12.500000
9,Friday,Latte,35.0,5.99,209.65,179.70,16.666667
10,Saturday,Espresso,45.0,3.99,179.55,179.55,0.000000
11,Saturday,Latte,35.0,5.99,209.65,209.65,0.000000
12,Sunday,Espresso,45.0,3.99,179.55,179.55,0.000000
13,Sunday,Latte,35.0,5.99,209.65,209.65,0.000000

In [291]:
# Moving to bios:
# .rank() basically just takes each value in a certain column, compares it to all the other columns, and assigns it a value
# In this case, it ranks the values in 'height_cm', where it assigns a bigger number for bigger values
bios['height_rank'] = bios['height_cm'].rank()
bios.sort_values(['height_rank'], ascending=False)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,month_born,year_born,height_rank
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN,9.0,1980.0,106651.0
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN,12.0,1964.0,106649.5
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN,2.0,1952.0,106649.5
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN,11.0,1975.0,106647.0
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN,11.0,1987.0,106647.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145490,149217,Sin Ye-Chan,1995-06-13,NaN,NaN,NaN,Republic of Korea,NaN,NaN,NaN,6.0,1995.0,NaN
145491,149218,Matthew Wepke,1989-12-05,NaN,NaN,NaN,Jamaica,NaN,NaN,NaN,12.0,1989.0,NaN
145492,149219,Carlos García-Ordóñez,1927-04-24,La Habana (Havana),Ciudad de La Habana,CUB,Cuba,NaN,NaN,2019-11-24,4.0,1927.0,NaN
145493,149220,Landysh Falyakhova,1998-08-31,Dva Polya Artash,Respublika Tatarstan,RUS,ROC,NaN,NaN,NaN,8.0,1998.0,NaN
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,7.0,1913.0,NaN

In [297]:
# Moving back to coffee df:
coffee['Cumulative Revenue'] = coffee['Revenue'].cumsum() # .cumsum() --> cumulative sum
coffee

,Day,Coffee Type,Units Sold,Price,Revenue,Yesterday Revenue,Percent Change,Cumulative Revenue
0,Monday,Espresso,25.0,3.99,99.75,NaN,NaN,99.75
1,Monday,Latte,15.0,5.99,89.85,NaN,NaN,189.60
2,Tuesday,Espresso,30.0,3.99,119.70,99.75,20.000000,309.30
3,Tuesday,Latte,20.0,5.99,119.80,89.85,33.333333,429.10
4,Wednesday,Espresso,35.0,3.99,139.65,119.70,16.666667,568.75
5,Wednesday,Latte,25.0,5.99,149.75,119.80,25.000000,718.50
6,Thursday,Espresso,40.0,3.99,159.60,139.65,14.285714,878.10
7,Thursday,Latte,30.0,5.99,179.70,149.75,20.000000,1057.80
8,Friday,Espresso,45.0,3.99,179.55,159.60,12.500000,1237.35
9,Friday,Latte,35.0,5.99,209.65,179.70,16.666667,1447.00
10,Saturday,Espresso,45.0,3.99,179.55,179.55,0.000000,1626.55
11,Saturday,Latte,35.0,5.99,209.65,209.65,0.000000,1836.20
12,Sunday,Espresso,45.0,3.99,179.55,179.55,0.000000,2015.75
13,Sunday,Latte,35.0,5.99,209.65,209.65,0.000000,2225.40

In [306]:
latte = coffee[coffee['Coffee Type'] == 'Latte'].copy()
latte['3day'] = latte['Units Sold'].rolling(3).sum() # This moves through each row, gets the last three revenue values, adds them up, and adds that value to the current row in the '3day' column
# .rolling(last # of rows to obtain values from) basically just gets the values from the last few rows (a number would be specified -- values from last two rows, last three, etc.)
latte
# Below: 60 = 15 + 20 + 25; 75 = 20 + 25 + 30; etc.

,Day,Coffee Type,Units Sold,Price,Revenue,Yesterday Revenue,Percent Change,Cumulative Revenue,3day
1,Monday,Latte,15.0,5.99,89.85,NaN,NaN,189.6,NaN
3,Tuesday,Latte,20.0,5.99,119.80,89.85,33.333333,429.1,NaN
5,Wednesday,Latte,25.0,5.99,149.75,119.80,25.000000,718.5,60.0
7,Thursday,Latte,30.0,5.99,179.70,149.75,20.000000,1057.8,75.0
9,Friday,Latte,35.0,5.99,209.65,179.70,16.666667,1447.0,90.0
11,Saturday,Latte,35.0,5.99,209.65,209.65,0.000000,1836.2,100.0
13,Sunday,Latte,35.0,5.99,209.65,209.65,0.000000,2225.4,105.0